<a href="https://colab.research.google.com/github/dmarinere/Moodle_-Education_data_Analysis/blob/master/Moodle_DataBase.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import psycopg2
import logging as logger
import pandas as pd
from sqlalchemy import create_engine

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%%sql
postgresql://tenac:password@localhost:5432/moodle

### Download the database and write an SQL script to count

#### The number of tables

In [ ]:
%%sql
SELECT count(*) AS TOTALNUMBEROFTABLES
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_SCHEMA = 'public'

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(448,)]

#### The number of records in each of the tables given in the MIT section

Standard Log

In [ ]:
%%sql
SELECT COUNT(*) FROM mdl_logstore_standard_log

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(417554,)]

In [ ]:
%%sql
SELECT COUNT(*) FROM mdl_modules

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(26,)]

In [ ]:
%%sql

SELECT COUNT(*)
FROM mdl_user;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(1052,)]

In [ ]:
%%sql

SELECT COUNT(*)
FROM mdl_grade_grades;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(3643,)]

In [ ]:
%%sql

SELECT COUNT(*)
FROM mdl_modules;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(26,)]

In [ ]:
%%sql

SELECT COUNT(*)
FROM mdl_course;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(15,)]

In [ ]:
%%sql

SELECT COUNT(*)
FROM mdl_course_modules_completion;

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(4483,)]

#### Number of quiz submissions by hour of day

In [ ]:
%%sql 
SELECT Extract(HOUR FROM to_timestamp(timecreated)) AS hour, count(*) 
FROM mdl_logstore_standard_log where action='submitted' AND component like '%quiz%' GROUP BY hour;

 * postgresql://tenac:***@localhost:5432/moodle
24 rows affected.

[(0.0, 30),
 (1.0, 29),
 (2.0, 7),
 (3.0, 14),
 (4.0, 10),
 (5.0, 18),
 (6.0, 17),
 (7.0, 34),
 (8.0, 46),
 (9.0, 69),
 (10.0, 95),
 (11.0, 88),
 (12.0, 104),
 (13.0, 90),
 (14.0, 80),
 (15.0, 68),
 (16.0, 68),
 (17.0, 70),
 (18.0, 57),
 (19.0, 55),
 (20.0, 46),
 (21.0, 53),
 (22.0, 26),
 (23.0, 23)]

#### Monthly usage time of learners who have confirmed and are not deleted

In [ ]:
%%sql

SELECT COUNT(lastaccess - firstaccess) AS usagetime, 
    EXTRACT (MONTH FROM to_timestamp(firstaccess)) AS month 
        FROM mdl_user 
            WHERE confirmed = 1 AND deleted = 0 
                GROUP BY EXTRACT (MONTH FROM to_timestamp(firstaccess))

 * postgresql://tenac:***@localhost:5432/moodle
7 rows affected.

[(58, 3.0),
 (31, 7.0),
 (450, 1.0),
 (227, 2.0),
 (27, 6.0),
 (140, 4.0),
 (111, 5.0)]

###  Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'loggedin' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(1, 1), (2, 169), (3, 107), (5, 54), (7, 3)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'viewed' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(0, 5305), (1, 2), (2, 2492), (3, 4041), (5, 694)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'started' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(2, 14), (3, 17), (5, 11), (7, 2), (8, 1)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'submitted' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(2, 21), (3, 2), (5, 5), (9, 8), (16, 1)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'uploaded' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(2, 21), (3, 6), (5, 1), (42, 1), (44, 1)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'updated' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(0, 649), (2, 2551), (3, 1467), (5, 19), (7, 1)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'searched' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(84, 2), (246, 1), (253, 1), (266, 2), (294, 1)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'resumed' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(3, 4), (5, 2), (9, 1), (25, 10), (39, 4)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'answered' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
5 rows affected.

[(5, 2), (9, 4), (25, 6), (38, 1), (39, 1)]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'attempted' GROUP BY userid limit 5

 * postgresql://tenac:***@localhost:5432/moodle
0 rows affected.

[]

In [ ]:
%%sql 
SELECT userid, COUNT(action) FROM mdl_logstore_standard_log WHERE action = 'abandoned' GROUP BY userid

 * postgresql://tenac:***@localhost:5432/moodle
1 rows affected.

[(2, 5)]

###  Python Class

In [ ]:
import psycopg2
import pandas as pd

# Connection parameters, yours will be different
param_dic = {
    "host"      : "localhost",
    "database"  : "moodle",
    "user"      : "tenac",
    "password"  : "password"
}

In [ ]:

def connect(params_dic):
    """ Connect to the PostgreSQL database server """
    conn = None
    try:
        # connect to the PostgreSQL server
        print('Connecting to the PostgreSQL database...')
        conn = psycopg2.connect(**params_dic)
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        sys.exit(1) 
    print("Connection successful")
    return conn

def postgresql_to_dataframe(conn,select_query, column_names):
    """
    Tranform a SELECT query into a pandas dataframe
    """
    #db = DBHandler()
    #db.open_local_db()
    cursor = conn.cursor()
    try:
        cursor.execute(select_query)
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        cursor.close()
        return 1

    # Naturally we get a list of tupples
    tupples = cursor.fetchall()
    cursor.close()

    # We just need to turn it into a pandas dataframe
    df = pd.DataFrame(tupples, columns=column_names)
    return df

In [ ]:
conn = connect(param_dic)

Connecting to the PostgreSQL database...
Connection successful

###

In [ ]:
column_names = ["Final grade", "User Id"]
# Execute the "SELECT *" query
df = postgresql_to_dataframe(conn, "select finalgrade, userid from mdl_grade_grades", column_names)
df.head()

  Final grade  User Id
0        None        3
1        None        3
2    12.00000       50
3     0.00000       65
4     0.00000       65